src/assets/artifacts/7ep-demo/telemetry/behavior-models/dfg/dfg.dot
digraph {
	graph [bgcolor=white rankdir=LR]
	node [shape=box]
	7213733630429968514 [label="CREATE TABLE datasource.sequence (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-686054106080288963 [label="CREATE TABLE ed2a18a9-6e94-490e-9642-feb9d0accea4.sequence (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	8931600043993093757 [label="CREATE index datasource (3)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	4821049518095400211 [label="CREATE index ed2a18a9-6e94-490e-9642-feb9d0accea4 (3)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-24730632584200728 [label="CREATE table datasource.account (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	1156204165241309199 [label="CREATE table datasource.bannerdata (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-3710657793909694689 [label="CREATE table datasource.category (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-3266208659466840004 [label="CREATE table datasource.inventory (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	5402237496164824564 [label="CREATE table datasource.item (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-3755008964373489735 [label="CREATE table datasource.lineitem (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-2111722804401890713 [label="CREATE table datasource.orders (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	1932292747627070790 [label="CREATE table datasource.orderstatus (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	2159275661980947454 [label="CREATE table datasource.product (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	2239383439799341978 [label="CREATE table datasource.profile (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	4087883234518895151 [label="CREATE table datasource.signon (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	4453435543207130865 [label="CREATE table datasource.supplier (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-8015032578877632462 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.account (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-6713387072957569905 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.bannerdata (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-3086722414340141710 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.category (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	3428731006800233316 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.inventory (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-2010126899917500312 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.item (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-2836215704901565690 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.lineitem (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	8950798944191544641 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.orders (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-2363978916663721077 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.orderstatus (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	8112830635992657447 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.product (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-5459734247463485987 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.profile (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	6802660584811804401 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.signon (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	8260556924913420126 [label="CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.supplier (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	511760654901896849 [label="GET (332)" fillcolor="#B9B9FF" fontsize=12 style=filled]
	-1717147942984757858 [label="GET /cargocpc/* (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-3190617866535272635 [label="GET /jpetstore/* (22)" fillcolor="#FAFAFF" fontsize=12 style=filled]
	240512778243073572 [label="GET /jpetstore/*.action (75)" fillcolor="#EFEFFF" fontsize=12 style=filled]
	940407135855789031 [label="INSERT datasource.ACCOUNT (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	5705801804381765115 [label="INSERT datasource.LINEITEM (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	864093686191160887 [label="INSERT datasource.ORDERS (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	1582514528248154232 [label="INSERT datasource.ORDERSTATUS (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-13631014794296231 [label="INSERT datasource.PROFILE (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-6662527359952079250 [label="INSERT datasource.SIGNON (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	5543450091565467926 [label="INSERT datasource.account (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-389525328207211774 [label="INSERT datasource.bannerdata (5)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-7047022956956940473 [label="INSERT datasource.category (5)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-4010997727692614468 [label="INSERT datasource.inventory (28)" fillcolor="#F9F9FF" fontsize=12 style=filled]
	-7287808449353100523 [label="INSERT datasource.item (28)" fillcolor="#F9F9FF" fontsize=12 style=filled]
	-7734970729343405775 [label="INSERT datasource.product (16)" fillcolor="#FBFBFF" fontsize=12 style=filled]
	-7541124600187106412 [label="INSERT datasource.profile (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-4014247797473812858 [label="INSERT datasource.sequence (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	8402977667252056327 [label="INSERT datasource.signon (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	5389651088935260325 [label="INSERT datasource.supplier (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-1166618181860502602 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.ACCOUNT (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-284224454543471752 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.LINEITEM (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-7493664045725570390 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.ORDERS (3)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-3325385763543343185 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.ORDERSTATUS (3)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	5664900873268372240 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.PROFILE (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-5540683264637463485 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.SIGNON (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	3692060647185920709 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.account (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	6751072124977453426 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.bannerdata (5)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-2793362175989472872 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.category (5)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-5215351831367794575 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.inventory (28)" fillcolor="#F9F9FF" fontsize=12 style=filled]
	202011824272591672 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.item (28)" fillcolor="#F9F9FF" fontsize=12 style=filled]
	-9107260503395574131 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.product (16)" fillcolor="#FBFBFF" fontsize=12 style=filled]
	-8884013999011388753 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.profile (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	5810868643755413022 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.sequence (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-1827290097268688995 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.signon (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-8094952818752454519 [label="INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.supplier (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-1457863869760512990 [label="POST (476)" fillcolor="#9B9BFF" fontsize=12 style=filled]
	1198411070111084605 [label="POST /jpetstore/*.action (9)" fillcolor="#FDFDFF" fontsize=12 style=filled]
	2510143385975677455 [label="Response.sendError (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	1923284983003031345 [label="ResponseFacade.sendRedirect (7)" fillcolor="#FDFDFF" fontsize=12 style=filled]
	-3528508850135937335 [label="SELECT datasource (13)" fillcolor="#FCFCFF" fontsize=12 style=filled]
	-9171791090480506108 [label="SELECT datasource.CATEGORY (5)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-3939337124952312583 [label="SELECT datasource.INVENTORY (3)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-893416678943355862 [label="SELECT datasource.LINEITEM (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-4748839194556293661 [label="SELECT datasource.PRODUCT (9)" fillcolor="#FDFDFF" fontsize=12 style=filled]
	-3772116002680965907 [label="SELECT datasource.SEQUENCE (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	6504919195168230246 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4 (6)" fillcolor="#FDFDFF" fontsize=12 style=filled]
	-6434407337225289200 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.CATEGORY (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	4508810949630714762 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.INVENTORY (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	557428842716174340 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.LINEITEM (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	2884616115893491877 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.PRODUCT (3)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	-6217741661798472688 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.SEQUENCE (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	6923655974256695294 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.account (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	7939521482205676423 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.inventory (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	8433743398967984201 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.lineitem (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	3122564330464127260 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.orders (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	5612574880156100208 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.orderstatus (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	2899542520107880014 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.profile (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	7127730542390562799 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.sequence (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-331082711126766284 [label="SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.signon (2)" fillcolor="#FEFEFF" fontsize=12 style=filled]
	7395567311879365268 [label="UPDATE datasource.INVENTORY (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	3738792037435820547 [label="UPDATE datasource.SEQUENCE (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	7573199542233660411 [label="UPDATE ed2a18a9-6e94-490e-9642-feb9d0accea4.ACCOUNT (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	6489021033602655420 [label="UPDATE ed2a18a9-6e94-490e-9642-feb9d0accea4.INVENTORY (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	1539550319282117012 [label="UPDATE ed2a18a9-6e94-490e-9642-feb9d0accea4.PROFILE (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	1174877932560281139 [label="UPDATE ed2a18a9-6e94-490e-9642-feb9d0accea4.SEQUENCE (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-7321172441505290701 [label="UPDATE ed2a18a9-6e94-490e-9642-feb9d0accea4.SIGNON (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	-8718322989402747513 [label="datasource (1)" fillcolor="#FFFFFF" fontsize=12 style=filled]
	511760654901896849 -> -1717147942984757858 [label=1 fontsize=12 penwidth=1.0]
	511760654901896849 -> 2510143385975677455 [label=1 fontsize=12 penwidth=1.0]
	240512778243073572 -> 1923284983003031345 [label=3 fontsize=12 penwidth=1.533332444445926]
	240512778243073572 -> -3528508850135937335 [label=7 fontsize=12 penwidth=2.599997333337778]
	240512778243073572 -> -9171791090480506108 [label=2 fontsize=12 penwidth=1.266666222222963]
	240512778243073572 -> -3939337124952312583 [label=2 fontsize=12 penwidth=1.266666222222963]
	240512778243073572 -> -4748839194556293661 [label=3 fontsize=12 penwidth=1.533332444445926]
	240512778243073572 -> -3772116002680965907 [label=1 fontsize=12 penwidth=1.0]
	940407135855789031 -> -13631014794296231 [label=1 fontsize=12 penwidth=1.0]
	864093686191160887 -> 1582514528248154232 [label=1 fontsize=12 penwidth=1.0]
	1582514528248154232 -> 5705801804381765115 [label=1 fontsize=12 penwidth=1.0]
	-13631014794296231 -> -6662527359952079250 [label=1 fontsize=12 penwidth=1.0]
	-6662527359952079250 -> -3528508850135937335 [label=1 fontsize=12 penwidth=1.0]
	1198411070111084605 -> 940407135855789031 [label=1 fontsize=12 penwidth=1.0]
	1198411070111084605 -> -3528508850135937335 [label=3 fontsize=12 penwidth=1.533332444445926]
	1198411070111084605 -> -4748839194556293661 [label=1 fontsize=12 penwidth=1.0]
	-3528508850135937335 -> 1923284983003031345 [label=2 fontsize=12 penwidth=1.266666222222963]
	-3528508850135937335 -> -3939337124952312583 [label=1 fontsize=12 penwidth=1.0]
	-3528508850135937335 -> -893416678943355862 [label=1 fontsize=12 penwidth=1.0]
	-3528508850135937335 -> -4748839194556293661 [label=5 fontsize=12 penwidth=2.066664888891852]
	-3939337124952312583 -> -3528508850135937335 [label=1 fontsize=12 penwidth=1.0]
	-893416678943355862 -> -3528508850135937335 [label=1 fontsize=12 penwidth=1.0]
	-4748839194556293661 -> 1923284983003031345 [label=2 fontsize=12 penwidth=1.266666222222963]
	-4748839194556293661 -> -9171791090480506108 [label=3 fontsize=12 penwidth=1.533332444445926]
	-3772116002680965907 -> 3738792037435820547 [label=1 fontsize=12 penwidth=1.0]
	7395567311879365268 -> 864093686191160887 [label=1 fontsize=12 penwidth=1.0]
	3738792037435820547 -> 7395567311879365268 [label=1 fontsize=12 penwidth=1.0]
	overlap=false
	fontsize=11
}
