src/assets/artifacts/7ep-demo/telemetry/behavior-models/dfg/dfg.mmd
flowchart LR
  n_7213733630429968514["CREATE TABLE datasource.sequence (1)"]
  _686054106080288963["CREATE TABLE ed2a18a9-6e94-490e-9642-feb9d0accea4.sequence (1)"]
  n_8931600043993093757["CREATE index datasource (3)"]
  n_4821049518095400211["CREATE index ed2a18a9-6e94-490e-9642-feb9d0accea4 (3)"]
  _24730632584200728["CREATE table datasource.account (1)"]
  n_1156204165241309199["CREATE table datasource.bannerdata (1)"]
  _3710657793909694689["CREATE table datasource.category (1)"]
  _3266208659466840004["CREATE table datasource.inventory (1)"]
  n_5402237496164824564["CREATE table datasource.item (1)"]
  _3755008964373489735["CREATE table datasource.lineitem (1)"]
  _2111722804401890713["CREATE table datasource.orders (1)"]
  n_1932292747627070790["CREATE table datasource.orderstatus (1)"]
  n_2159275661980947454["CREATE table datasource.product (1)"]
  n_2239383439799341978["CREATE table datasource.profile (1)"]
  n_4087883234518895151["CREATE table datasource.signon (1)"]
  n_4453435543207130865["CREATE table datasource.supplier (1)"]
  _8015032578877632462["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.account (1)"]
  _6713387072957569905["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.bannerdata (1)"]
  _3086722414340141710["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.category (1)"]
  n_3428731006800233316["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.inventory (1)"]
  _2010126899917500312["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.item (1)"]
  _2836215704901565690["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.lineitem (1)"]
  n_8950798944191544641["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.orders (1)"]
  _2363978916663721077["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.orderstatus (1)"]
  n_8112830635992657447["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.product (1)"]
  _5459734247463485987["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.profile (1)"]
  n_6802660584811804401["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.signon (1)"]
  n_8260556924913420126["CREATE table ed2a18a9-6e94-490e-9642-feb9d0accea4.supplier (1)"]
  n_511760654901896849["GET (332)"]
  _1717147942984757858["GET /cargocpc/* (1)"]
  _3190617866535272635["GET /jpetstore/* (22)"]
  n_240512778243073572["GET /jpetstore/*.action (75)"]
  n_940407135855789031["INSERT datasource.ACCOUNT (1)"]
  n_5705801804381765115["INSERT datasource.LINEITEM (1)"]
  n_864093686191160887["INSERT datasource.ORDERS (1)"]
  n_1582514528248154232["INSERT datasource.ORDERSTATUS (1)"]
  _13631014794296231["INSERT datasource.PROFILE (1)"]
  _6662527359952079250["INSERT datasource.SIGNON (1)"]
  n_5543450091565467926["INSERT datasource.account (2)"]
  _389525328207211774["INSERT datasource.bannerdata (5)"]
  _7047022956956940473["INSERT datasource.category (5)"]
  _4010997727692614468["INSERT datasource.inventory (28)"]
  _7287808449353100523["INSERT datasource.item (28)"]
  _7734970729343405775["INSERT datasource.product (16)"]
  _7541124600187106412["INSERT datasource.profile (2)"]
  _4014247797473812858["INSERT datasource.sequence (1)"]
  n_8402977667252056327["INSERT datasource.signon (2)"]
  n_5389651088935260325["INSERT datasource.supplier (2)"]
  _1166618181860502602["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.ACCOUNT (1)"]
  _284224454543471752["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.LINEITEM (2)"]
  _7493664045725570390["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.ORDERS (3)"]
  _3325385763543343185["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.ORDERSTATUS (3)"]
  n_5664900873268372240["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.PROFILE (1)"]
  _5540683264637463485["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.SIGNON (1)"]
  n_3692060647185920709["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.account (2)"]
  n_6751072124977453426["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.bannerdata (5)"]
  _2793362175989472872["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.category (5)"]
  _5215351831367794575["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.inventory (28)"]
  n_202011824272591672["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.item (28)"]
  _9107260503395574131["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.product (16)"]
  _8884013999011388753["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.profile (2)"]
  n_5810868643755413022["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.sequence (1)"]
  _1827290097268688995["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.signon (2)"]
  _8094952818752454519["INSERT ed2a18a9-6e94-490e-9642-feb9d0accea4.supplier (2)"]
  _1457863869760512990["POST (476)"]
  n_1198411070111084605["POST /jpetstore/*.action (9)"]
  n_2510143385975677455["Response.sendError (1)"]
  n_1923284983003031345["ResponseFacade.sendRedirect (7)"]
  _3528508850135937335["SELECT datasource (13)"]
  _9171791090480506108["SELECT datasource.CATEGORY (5)"]
  _3939337124952312583["SELECT datasource.INVENTORY (3)"]
  _893416678943355862["SELECT datasource.LINEITEM (1)"]
  _4748839194556293661["SELECT datasource.PRODUCT (9)"]
  _3772116002680965907["SELECT datasource.SEQUENCE (1)"]
  n_6504919195168230246["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4 (6)"]
  _6434407337225289200["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.CATEGORY (2)"]
  n_4508810949630714762["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.INVENTORY (1)"]
  n_557428842716174340["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.LINEITEM (1)"]
  n_2884616115893491877["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.PRODUCT (3)"]
  _6217741661798472688["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.SEQUENCE (1)"]
  n_6923655974256695294["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.account (2)"]
  n_7939521482205676423["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.inventory (1)"]
  n_8433743398967984201["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.lineitem (1)"]
  n_3122564330464127260["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.orders (1)"]
  n_5612574880156100208["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.orderstatus (1)"]
  n_2899542520107880014["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.profile (2)"]
  n_7127730542390562799["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.sequence (1)"]
  _331082711126766284["SELECT ed2a18a9-6e94-490e-9642-feb9d0accea4.signon (2)"]
  n_7395567311879365268["UPDATE datasource.INVENTORY (1)"]
  n_3738792037435820547["UPDATE datasource.SEQUENCE (1)"]
  n_7573199542233660411["UPDATE ed2a18a9-6e94-490e-9642-feb9d0accea4.ACCOUNT (1)"]
  n_6489021033602655420["UPDATE ed2a18a9-6e94-490e-9642-feb9d0accea4.INVENTORY (1)"]
  n_1539550319282117012["UPDATE ed2a18a9-6e94-490e-9642-feb9d0accea4.PROFILE (1)"]
  n_1174877932560281139["UPDATE ed2a18a9-6e94-490e-9642-feb9d0accea4.SEQUENCE (1)"]
  _7321172441505290701["UPDATE ed2a18a9-6e94-490e-9642-feb9d0accea4.SIGNON (1)"]
  _8718322989402747513["datasource (1)"]
  n_511760654901896849 -->|1| _1717147942984757858
  n_511760654901896849 -->|1| n_2510143385975677455
  n_240512778243073572 -->|3| n_1923284983003031345
  n_240512778243073572 -->|7| _3528508850135937335
  n_240512778243073572 -->|2| _9171791090480506108
  n_240512778243073572 -->|2| _3939337124952312583
  n_240512778243073572 -->|3| _4748839194556293661
  n_240512778243073572 -->|1| _3772116002680965907
  n_940407135855789031 -->|1| _13631014794296231
  n_864093686191160887 -->|1| n_1582514528248154232
  n_1582514528248154232 -->|1| n_5705801804381765115
  _13631014794296231 -->|1| _6662527359952079250
  _6662527359952079250 -->|1| _3528508850135937335
  n_1198411070111084605 -->|1| n_940407135855789031
  n_1198411070111084605 -->|3| _3528508850135937335
  n_1198411070111084605 -->|1| _4748839194556293661
  _3528508850135937335 -->|2| n_1923284983003031345
  _3528508850135937335 -->|1| _3939337124952312583
  _3528508850135937335 -->|1| _893416678943355862
  _3528508850135937335 -->|5| _4748839194556293661
  _3939337124952312583 -->|1| _3528508850135937335
  _893416678943355862 -->|1| _3528508850135937335
  _4748839194556293661 -->|2| n_1923284983003031345
  _4748839194556293661 -->|3| _9171791090480506108
  _3772116002680965907 -->|1| n_3738792037435820547
  n_7395567311879365268 -->|1| n_864093686191160887
  n_3738792037435820547 -->|1| n_7395567311879365268
  style n_7213733630429968514 fill:#FFFFFF
  style _686054106080288963 fill:#FFFFFF
  style n_8931600043993093757 fill:#FEFEFF
  style n_4821049518095400211 fill:#FEFEFF
  style _24730632584200728 fill:#FFFFFF
  style n_1156204165241309199 fill:#FFFFFF
  style _3710657793909694689 fill:#FFFFFF
  style _3266208659466840004 fill:#FFFFFF
  style n_5402237496164824564 fill:#FFFFFF
  style _3755008964373489735 fill:#FFFFFF
  style _2111722804401890713 fill:#FFFFFF
  style n_1932292747627070790 fill:#FFFFFF
  style n_2159275661980947454 fill:#FFFFFF
  style n_2239383439799341978 fill:#FFFFFF
  style n_4087883234518895151 fill:#FFFFFF
  style n_4453435543207130865 fill:#FFFFFF
  style _8015032578877632462 fill:#FFFFFF
  style _6713387072957569905 fill:#FFFFFF
  style _3086722414340141710 fill:#FFFFFF
  style n_3428731006800233316 fill:#FFFFFF
  style _2010126899917500312 fill:#FFFFFF
  style _2836215704901565690 fill:#FFFFFF
  style n_8950798944191544641 fill:#FFFFFF
  style _2363978916663721077 fill:#FFFFFF
  style n_8112830635992657447 fill:#FFFFFF
  style _5459734247463485987 fill:#FFFFFF
  style n_6802660584811804401 fill:#FFFFFF
  style n_8260556924913420126 fill:#FFFFFF
  style n_511760654901896849 fill:#B9B9FF
  style _1717147942984757858 fill:#FFFFFF
  style _3190617866535272635 fill:#FAFAFF
  style n_240512778243073572 fill:#EFEFFF
  style n_940407135855789031 fill:#FFFFFF
  style n_5705801804381765115 fill:#FFFFFF
  style n_864093686191160887 fill:#FFFFFF
  style n_1582514528248154232 fill:#FFFFFF
  style _13631014794296231 fill:#FFFFFF
  style _6662527359952079250 fill:#FFFFFF
  style n_5543450091565467926 fill:#FEFEFF
  style _389525328207211774 fill:#FEFEFF
  style _7047022956956940473 fill:#FEFEFF
  style _4010997727692614468 fill:#F9F9FF
  style _7287808449353100523 fill:#F9F9FF
  style _7734970729343405775 fill:#FBFBFF
  style _7541124600187106412 fill:#FEFEFF
  style _4014247797473812858 fill:#FFFFFF
  style n_8402977667252056327 fill:#FEFEFF
  style n_5389651088935260325 fill:#FEFEFF
  style _1166618181860502602 fill:#FFFFFF
  style _284224454543471752 fill:#FEFEFF
  style _7493664045725570390 fill:#FEFEFF
  style _3325385763543343185 fill:#FEFEFF
  style n_5664900873268372240 fill:#FFFFFF
  style _5540683264637463485 fill:#FFFFFF
  style n_3692060647185920709 fill:#FEFEFF
  style n_6751072124977453426 fill:#FEFEFF
  style _2793362175989472872 fill:#FEFEFF
  style _5215351831367794575 fill:#F9F9FF
  style n_202011824272591672 fill:#F9F9FF
  style _9107260503395574131 fill:#FBFBFF
  style _8884013999011388753 fill:#FEFEFF
  style n_5810868643755413022 fill:#FFFFFF
  style _1827290097268688995 fill:#FEFEFF
  style _8094952818752454519 fill:#FEFEFF
  style _1457863869760512990 fill:#9B9BFF
  style n_1198411070111084605 fill:#FDFDFF
  style n_2510143385975677455 fill:#FFFFFF
  style n_1923284983003031345 fill:#FDFDFF
  style _3528508850135937335 fill:#FCFCFF
  style _9171791090480506108 fill:#FEFEFF
  style _3939337124952312583 fill:#FEFEFF
  style _893416678943355862 fill:#FFFFFF
  style _4748839194556293661 fill:#FDFDFF
  style _3772116002680965907 fill:#FFFFFF
  style n_6504919195168230246 fill:#FDFDFF
  style _6434407337225289200 fill:#FEFEFF
  style n_4508810949630714762 fill:#FFFFFF
  style n_557428842716174340 fill:#FFFFFF
  style n_2884616115893491877 fill:#FEFEFF
  style _6217741661798472688 fill:#FFFFFF
  style n_6923655974256695294 fill:#FEFEFF
  style n_7939521482205676423 fill:#FFFFFF
  style n_8433743398967984201 fill:#FFFFFF
  style n_3122564330464127260 fill:#FFFFFF
  style n_5612574880156100208 fill:#FFFFFF
  style n_2899542520107880014 fill:#FEFEFF
  style n_7127730542390562799 fill:#FFFFFF
  style _331082711126766284 fill:#FEFEFF
  style n_7395567311879365268 fill:#FFFFFF
  style n_3738792037435820547 fill:#FFFFFF
  style n_7573199542233660411 fill:#FFFFFF
  style n_6489021033602655420 fill:#FFFFFF
  style n_1539550319282117012 fill:#FFFFFF
  style n_1174877932560281139 fill:#FFFFFF
  style _7321172441505290701 fill:#FFFFFF
  style _8718322989402747513 fill:#FFFFFF
  linkStyle 0 stroke-width:1px
  linkStyle 1 stroke-width:1px
  linkStyle 2 stroke-width:1.533332444445926px
  linkStyle 3 stroke-width:2.599997333337778px
  linkStyle 4 stroke-width:1.266666222222963px
  linkStyle 5 stroke-width:1.266666222222963px
  linkStyle 6 stroke-width:1.533332444445926px
  linkStyle 7 stroke-width:1px
  linkStyle 8 stroke-width:1px
  linkStyle 9 stroke-width:1px
  linkStyle 10 stroke-width:1px
  linkStyle 11 stroke-width:1px
  linkStyle 12 stroke-width:1px
  linkStyle 13 stroke-width:1px
  linkStyle 14 stroke-width:1.533332444445926px
  linkStyle 15 stroke-width:1px
  linkStyle 16 stroke-width:1.266666222222963px
  linkStyle 17 stroke-width:1px
  linkStyle 18 stroke-width:1px
  linkStyle 19 stroke-width:2.066664888891852px
  linkStyle 20 stroke-width:1px
  linkStyle 21 stroke-width:1px
  linkStyle 22 stroke-width:1.266666222222963px
  linkStyle 23 stroke-width:1.533332444445926px
  linkStyle 24 stroke-width:1px
  linkStyle 25 stroke-width:1px
  linkStyle 26 stroke-width:1px
